{
  "add_cross_attention": false,
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "function_to_apply": "sigmoid",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "toxicity",
    "1": "severe_toxicity",
    "2": "obscene",
    "3": "identity_attack",
    "4": "insult",
    "5": "threat",
    "6": "sexual_explicit",
    "7": "male",
    "8": "female",
    "9": "homosexual_gay_or_lesbian",
    "10": "christian",
    "11": "jewish",
    "12": "muslim",
    "13": "black",
    "14": "white",
    "15": "psychiatric_or_mental_illness"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "black": 13,
    "christian": 10,
    "female": 8,
    "homosexual_gay_or_lesbian": 9,
    "identity_attack": 3,
    "insult": 4,
    "jewish": 11,
    "male": 7,
    "muslim": 12,
    "obscene": 2,
    "psychiatric_or_mental_illness": 15,
    "severe_toxicity": 1,
    "sexual_explicit": 6,
    "threat": 5,
    "toxicity": 0,
    "white": 14
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "problem_type": "multi_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
